libs/sopimus_template.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	       xmlns:urn="urn:cms:b2b:v01"
	       xmlns:urn2="urn:fi:Datahub:mif:common:HDR_Header:elements:v1"
	       xmlns:urn3="urn:fi:Datahub:mif:common:PEC_ProcessEnergyContext:elements:v1"
	       xmlns:urn11="urn:fi:Datahub:mif:masterdata:F04_MasterDataContractEvent:v1"
	       xmlns:urn12="urn:fi:Datahub:mif:masterdata:F04_MasterDataContractEvent:elements:v1"
	       >
  <soap:Header/>
  <soap:Body>
    <urn:ProcessMessageRequest>
      <urn:MessageContainer>
	<urn:Payload>
	  <!--You have a CHOICE of the next 14 items at this level-->
	  <urn11:MasterDataContractEventMessage>
	    <urn11:MasterDataContractEvent>
	      <urn11:Header>
		<urn2:Identification></urn2:Identification>
		<urn2:DocumentType>F04</urn2:DocumentType>
		<urn2:Creation></urn2:Creation>
		<urn2:PhysicalSenderEnergyParty>
		  <urn2:Identification
		      schemeAgencyIdentifier="9">0</urn2:Identification>
		</urn2:PhysicalSenderEnergyParty>
		<urn2:JuridicalSenderEnergyParty>
		  <urn2:Identification
		      schemeAgencyIdentifier="9">0</urn2:Identification>
		</urn2:JuridicalSenderEnergyParty>
		<urn2:JuridicalRecipientEnergyParty>
		  <urn2:Identification
		      schemeAgencyIdentifier="9">6410000000001</urn2:Identification>
		</urn2:JuridicalRecipientEnergyParty>
		<urn2:PhysicalRecipientEnergyParty>
		  <urn2:Identification
		      schemeAgencyIdentifier="9">6410000000001</urn2:Identification>
		</urn2:PhysicalRecipientEnergyParty>
	      </urn11:Header>
	      <urn11:ProcessEnergyContext>
		<urn3:EnergyBusinessProcess>DH-311-1</urn3:EnergyBusinessProcess>
		<urn3:EnergyBusinessProcessRole>DDQ</urn3:EnergyBusinessProcessRole>
		<urn3:EnergyIndustryClassification>23</urn3:EnergyIndustryClassification>
	      </urn11:ProcessEnergyContext>
	      <urn11:Transaction>
		<urn12:StartOfOccurrence>2019-08-28T21:00:00Z</urn12:StartOfOccurrence>
		<urn12:MeteringPointOfContract>
		  <urn12:Identification
		      schemeAgencyIdentifier="9">642902010871620352</urn12:Identification>
		</urn12:MeteringPointOfContract>
		<urn12:MeteringGridAreaUsedDomainLocation>
		  <urn12:Identification
		      schemeAgencyIdentifier="305">0</urn12:Identification>
		</urn12:MeteringGridAreaUsedDomainLocation>
		<urn12:MasterDataContract>
		  <urn12:ContactType
		      listAgencyIdentifier="NFI">AC01</urn12:ContactType>
		  <!-- Myyjäkohtaisesti uniikki ID-->
		  <urn12:Identification>2548247558</urn12:Identification>
		  <urn12:ContractType>12</urn12:ContractType>
		  <urn12:DeliveryContract>0</urn12:DeliveryContract>
		  <urn12:TimeLimited>0</urn12:TimeLimited>
		  <urn12:InvoicingMethod
		      listAgencyIdentifier="NFI">AH01</urn12:InvoicingMethod>
		  <urn12:NoticeBasis>0</urn12:NoticeBasis>
		  <urn12:Priority>1</urn12:Priority>
		  <urn12:InvoicingChannel
		      listAgencyIdentifier="NFI">AI02</urn12:InvoicingChannel>
		  <urn12:Contact>
		    <urn12:ContactType
			listAgencyIdentifier="NFI">AL02</urn12:ContactType>
		    <urn12:GivenName>GivenNameTest</urn12:GivenName>
		    <urn12:ContractCommunication>
		      <urn12:CommunicationChannel
			  listAgencyIdentifier="NFI">AD02</urn12:CommunicationChannel>
		      <urn12:CompleteNumber>tester01@example.com</urn12:CompleteNumber>
		    </urn12:ContractCommunication>
		  </urn12:Contact>
		  <urn12:InvoicingAddress>
		    <urn12:Postcode>00510</urn12:Postcode>
		    <urn12:Pobox>20</urn12:Pobox>
		    <urn12:CityName>Helsinki</urn12:CityName>
		    <urn12:CountryCode
			schemeAgencyIdentifier="5">FI</urn12:CountryCode>
		  </urn12:InvoicingAddress>
		  <urn12:ElectronicInvoiceAddressDetails>
		    <urn12:ElectronicInvoiceTargetId>50012345</urn12:ElectronicInvoiceTargetId>
		    <urn12:ElectronicInvoiceAddress>NL61INGB</urn12:ElectronicInvoiceAddress>
		    <urn12:ElectronicInvoiceRouter>BankID</urn12:ElectronicInvoiceRouter>
		  </urn12:ElectronicInvoiceAddressDetails>
		  <urn12:SupplierOfContract>
		    <urn12:Identification
			schemeAgencyIdentifier="9">6427010100003</urn12:Identification>
		  </urn12:SupplierOfContract>
		  <urn12:ConsumerInvolvedCustomerParty>
		    <urn12:Identification
			schemeAgencyIdentifier="260"></urn12:Identification>
		    <urn12:IdentificationType
			listAgencyIdentifier="NFI">AA02</urn12:IdentificationType>
		    <urn12:CustomerType
			listAgencyIdentifier="NFI">AB01</urn12:CustomerType>
		    <urn12:CustomerSubType
			listAgencyIdentifier="NFI">BF01</urn12:CustomerSubType>
		    <urn12:InformationRestriction>0</urn12:InformationRestriction>
		    <urn12:Language
			schemeAgencyIdentifier="5">fi</urn12:Language>
		    <urn12:Name>abcd</urn12:Name>
		    <urn12:CustomerCommunication>
		      <urn12:CommunicationChannel
			  listAgencyIdentifier="NFI">AD02</urn12:CommunicationChannel>
		      <urn12:CompleteNumber>tester1@example.com</urn12:CompleteNumber>
		    </urn12:CustomerCommunication>
		    <urn12:ConsumerInvolvedCustomerAddress>
		      <urn12:Postcode>00100</urn12:Postcode>
		      <urn12:Pobox>101</urn12:Pobox>
		      <urn12:CityName>Helsinki</urn12:CityName>
		      <urn12:CountryCode
			  schemeAgencyIdentifier="5">FI</urn12:CountryCode>
		    </urn12:ConsumerInvolvedCustomerAddress>
		  </urn12:ConsumerInvolvedCustomerParty>
		</urn12:MasterDataContract>
	      </urn11:Transaction>
	    </urn11:MasterDataContractEvent>
	  </urn11:MasterDataContractEventMessage>
	</urn:Payload>
      </urn:MessageContainer>
    </urn:ProcessMessageRequest>
  </soap:Body>
</soap:Envelope>
